workers = [
    ['Прізвище', 'Ім\'я', 'Відділ', 'Зарплата'],
    ['Гаврилюк', 'Катерина', 'Юридичний', 14200],
    ['Мельник', 'Василь', 'ІТ-відділ', 18900],
    ['Бондар', 'Олена', 'Продажі', 9900],
    ['Захаренко', 'Артем', 'Маркетинг', 11200],
    ['Коваль', 'Наталія', 'Склад', 8600]
]

def show_machinegram(info_list, num_lines = 1):
    for i in range(num_lines + 1):
        info = info_list[i]
        print(f"{info[0]:<15}{info[1]:<15}{info[2]:<15}{info[3]:>10}")

if __name__ == '__main__':
    show_machinegram(workers)